rails-server/app/controllers/users_controller.rb

  def create
    user = User.new(email: params["email"], user_name: params["username"], password: params["password"], image_url: "image_url")
    p user
    if user.save
---
INSERT INTO "users" ("email", "user_name", "hashword", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "asdf"], ["user_name", "asdf"], ["hashword", "asdf"], ["image_url", "image_url"], ["created_at", "2016-06-05 03:25:16.993247"], ["updated_at", "2016-06-05 03:25:16.993247"]]